{"sequence": "PROCEDURE\n\nThe case originated in an application (no. 7605/05) against the Republic of Turkey lodged with the Court under Article 34 of the Convention for the Protection of Human Rights and Fundamental Freedoms (“the Convention”) by a Turkish national, Mr Ahmet Akif Mücek (“the applicant”), on 4 February 2005.\n\nThe applicant was represented by Mr H. Şenses, a lawyer practising in Istanbul. The Turkish Government (“the Government”) were represented by their Agent.\n\nOn 27 March 2008 the President of the Second Section decided to give notice of the application to the Government. It was also decided to examine the merits of the application at the same time as its admissibility (Article 29 § 3).\n\nTHE FACTS\n\nThe applicant was born in 1960 and lives in Kandıra.\n\nOn 26 November 1995 the applicant was taken into custody by police officers from the Anti-Terrorist Branch of the Istanbul Security Directorate on suspicion of membership of an illegal organisation, namely the Dev-Yol (Revolutionary Way). On 8 December 1995 he was brought before the investigating judge at the Istanbul State Security Court, who ordered him to be detained pending trial. On 9 May 1996 the public prosecutor at the Istanbul State Security Court filed an indictment against the applicant and twelve other accused. Invoking Article 146 of the Criminal Code, he accused the applicant of membership of an illegal armed organisation and of involvement in activities which undermined the constitutional order of the State.\n\nThe trial commenced before the Istanbul State Security Court. In the subsequent hearings the court refused to release the applicant on account of the nature of the alleged offence and the state of the evidence. On 7 May 2004 the State Security Courts were abolished following a constitutional amendment, and the applicant’s case was transferred to the Istanbul Assize Court. On 30 November 2006 the applicant was released pending trial.", "target": "Ahmet Akif Mücek", "posList": [[54, 61], [75, 93], [235, 242], [253, 272], [295, 310], [346, 358], [383, 391], [472, 485], [738, 742], [756, 763], [769, 785], [851, 909], [976, 983], [1008, 1023], [1077, 1106], [1157, 1167], [1304, 1336], [1714, 1724], [1729, 1750], [1852, 1873], [1878, 1894]]}